alacritty
aldente
alfred
anki
arduino
calibre
dbeaver-community
discord
docker
firefox
gns3
google-chrome
intellij-idea-ce
itsycal
karabiner-elements
keka
keycastr
linearmouse
notion
postman
remnote
skim
spotify
todoist
ubersicht
vlc
wireshark
